/*
Ддаден е масив, който съсдържа адрес за изпращане на писмо. На всяка от позициите има
съответно: [име на получател, държава, град, адрес, пощенски код]. Напишете метод,
който приема като параметър такъв масив и връща низ, съдържащ адреса, форматиран
по следния начин:

Име, Държава
Град ПК, Адрес

Примерен резултат:

Иван Иванов, България
Враца 3000, ул. Кокиче 14
 */
public class LetterAddress {
    public static void main(String[] args) {
        String[] post = {"Иван Иванов", "България", "Враца", "3000", "Кокиче 14"};

        System.out.println(String.format("%s, %s", post[0], post[1]));
        System.out.println(String.format("%s, %s, %s", post[2], post[3], post[4]));
    }
}
